In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({ 'a' : [1,2,3,4],
                      'b' : [4,5,6,7],
                      'c' : ['Shad','krish','shanza','abhishek']    
                     
    
})

In [8]:
df

   a  b         c
0  1  4      Shad
1  2  5     krish
2  3  6    shanza
3  4  7  abhishek

In [9]:
#Converting a into the index permanently 

df.set_index('a',inplace = True)

In [10]:
df

   b         c
a
1  4      Shad
2  5     krish
3  6    shanza
4  7  abhishek

In [12]:
#Reseting index
#Again assigining to to reset it permanently
df = df.reset_index()

In [13]:
df

   a  b         c
0  1  4      Shad
1  2  5     krish
2  3  6    shanza
3  4  7  abhishek

In [20]:
#Creating the new dataframe and assigning it user's choice index

df1 = pd.DataFrame({'a' : [1,2,3,4],
        'b' : [4,5,6,7],
        'c' : ["shad","krish",'shabaz',"moin"]
    
},
        index = ['a','b','c','d']

)

In [21]:
df1

   a  b       c
a  1  4    shad
b  2  5   krish
c  3  6  shabaz
d  4  7    moin

In [24]:
#Rearranging the index according to the user's choice 

df1.reindex(['b','c','a','d'])

   a  b       c
b  2  5   krish
c  3  6  shabaz
a  1  4    shad
d  4  7    moin

In [25]:
#Here i iterating through the indexes and j is iterating through its data

for i , j in df1.iterrows():
    print(i,j)
    
    
#NOTE: If we dont want to display index,We can simply remove i from the print()

a a       1
b       4
c    shad
Name: a, dtype: object
b a        2
b        5
c    krish
Name: b, dtype: object
c a         3
b         6
c    shabaz
Name: c, dtype: object
d a       4
b       7
c    moin
Name: d, dtype: object

In [26]:
#In iteritems() it will displau the data column wise
#first its will display name of the column then it will displau the data of the column

for column_name, column_data in df1.iteritems(): #column_name, column_data = i,j
    print(column_name, column_data )

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a      shad
b     krish
c    shabaz
d      moin
Name: c, dtype: object

/tmp/ipykernel_91/2524171411.py:4: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column_name, column_data in df1.iteritems(): #column_name, column_data = i,j

In [27]:
df,df1

(   a  b         c
 0  1  4      Shad
 1  2  5     krish
 2  3  6    shanza
 3  4  7  abhishek,
    a  b       c
 a  1  4    shad
 b  2  5   krish
 c  3  6  shabaz
 d  4  7    moin)

In [28]:
#using coprehensive technique in for loop
#showing df['b'] in list for which was in series form which we can see above

[i for i in df['b']]

[4, 5, 6, 7]

In [29]:
#There is another way too for coverting the series into the list format

list(df['b'])

[4, 5, 6, 7]

In [30]:
df1

   a  b       c
a  1  4    shad
b  2  5   krish
c  3  6  shabaz
d  4  7    moin

In [31]:
#To find the submission of all the data present in column a :

def test(x):
    return x.sum()

df1.apply(test) #here,by default axis= 0,as axis =1 can not concat 1+4+shad.

#Or we can use the lambda function too 

df1.apply(lambda x : x.sum())

a                     10
b                     22
c    shadkrishshabazmoin
dtype: object

In [32]:
#To find square of all the elements
#Firstly,Seperating numeric values


df2 = df[['a', 'b']]

In [33]:

df2

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [34]:
#using applymap()function to apply the function on whole dataframe,
#as apply() can be used on only 1 column

df2.applymap(lambda x: x**2)

    a   b
0   1  16
1   4  25
2   9  36
3  16  49

In [36]:
#Performing sorting operation on name (c) column using sort_values() function.

df.sort_values('c' , ascending = False)

   a  b         c
2  3  6    shanza
1  2  5     krish
3  4  7  abhishek
0  1  4      Shad

In [38]:
#Sorting according to the indexes in desceding order


df.sort_index(ascending = False)

   a  b         c
3  4  7  abhishek
2  3  6    shanza
1  2  5     krish
0  1  4      Shad

In [41]:
df3 = pd.DataFrame({'Desc' : ['A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.' ]  })

In [43]:
df3 #As we can see it's unable to display the whole values on the screen because data is too much

                                                Desc
0  A Python Developer is responsible for coding, ...

In [50]:
#this function will allow to display the whole data on the screen
#Will display column width according to user's choice

pd.set_option('display.max.colwidth',500)
df3

                                                                                                                                                                                                                                 Desc
0  A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.

In [51]:
df3 = pd.DataFrame({'Desc' : [' A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.','My name is shadab khan', 'I study in amity university lucknow','I am persuing mca after completing the Bca']  })

In [54]:
#Now we are going to see how this function help us when we have huge amount of data in datafrane.
#Storing multiple data into the df3

pd.set_option('display.max.colwidth', 500)
df3

                                                                                                                                                                                                                                  Desc
0   A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.
1                                                                                                                                                                                                               My name is shadab khan
2                                                                                                                                                                                                  I study in amity university lucknow
3                                                                                                                                                                                           I am persuing mca after completing the Bca

In [55]:
#finding the length of the each row or each data stored in desc

df3['length'] = df3['Desc'].apply(len)

In [56]:
df3

,Desc,length
0,"A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.",227
1,My name is shadab khan,22
2,I study in amity university lucknow,35
3,I am persuing mca after completing the Bca,42

In [58]:
#Counting the words using the split and len function 

t = 'I am persuing mca after completing the bca '
len(t.split())

#First we split the words then count that words using len function

8

In [59]:
#finding how many words using ['word_count']function, and store it in new column.
#First we wll create a new column

df3['Word_count'] = df3['Desc'].apply(lambda x : len(x.split() ) )

In [60]:

df3

,Desc,length,Word_count
0,"A Python Developer is responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.",227,29
1,My name is shadab khan,22,5
2,I study in amity university lucknow,35,6
3,I am persuing mca after completing the Bca,42,8

In [61]:
#Going to do  use some common stastical function 

df

   a  b         c
0  1  4      Shad
1  2  5     krish
2  3  6    shanza
3  4  7  abhishek

In [62]:
#To find avg or mean value of the column a

df['a'].mean()

2.5

In [64]:
#Finding the max value
df['a'].max()

4

In [65]:
df['a'].median()

2.5

In [66]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [67]:
df['a'].min()

1

In [ ]:
#To finding the stan